/***************************************************************************************************
                        Project                  :                  seer_lander
                        MCU                      :                  None
                        IDE                      :                  QT5(CMake+MSVC2017)
                        File                     :                  dm.h
                        Brief                    :                  大漠插件基头文件
                        Developer                :                  金欣嵘
                        Other                    :                  
====================================================================================================

====================================================================================================
                                              History
====================================================================================================
----------------------------------------------------------------------------------------------------
                                            Brief 补充注释
----------------------------------------------------------------------------------------------------
                        Branch                   :                  dev_h5_lander_mode
                        Commit                   :                  eebfe18f3
----------------------------------------------------------------------------------------------------
***************************************************************************************************/
#ifndef __DM_H__
#define __DM_H__

#include <ActiveQt/QAxWidget>

typedef struct pic_info_t
{
    int index;          //图片id
    int x;              //x
    int y;              //y
}pic_info_t;
class DM
{

public:
    DM();
    ~DM();
    void bind_window(uint32_t pid);
    pic_info_t find_pic(int x1, int y1, int x2, int y2, QString pic_name, QString delta_color, double sim, int dir);

private:
    QAxWidget * dm_handle;
    void reg(void);
    QString handle_init(void);
};

#endif // __DM_H__
